results/M2/M2-20260920T123901Z/sphere_M6_fine/dictionaries/system/sampleLine
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleLine;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

type            sets;
libs            (sampling);
interpolationScheme cell;          // raw cell values: no interpolation smearing the shock
setFormat       raw;
fields          (p rho T U);

sets
{
    stagnationLine
    {
        type    midPoint;
        axis    x;
        start   (-0.15646642257 5e-05 0);
        end     (-5e-10 5e-05 0);
    }
}
